app/Controllers/AdminController.php

    public function viewManageProducts()
    {
        $categoryModel = new CategoryModel($db);
        $brandModel = new BrandModel($db);
        $productModel = new ProductModel($db);

        $products = $productModel->withDeleted()->paginate(10);
---
SELECT *
FROM `products`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `products`

    public function viewManageUsers()
    {
        $userModel = new UserModel($db);

        $users = $userModel->withDeleted()->paginate(10);
---
SELECT *
FROM `users`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`