app/Controllers/ViewController.php

    public function marketing()
    {
        $request = \Config\Services::request();
        $productModel = new ProductModel($db);
        $product = $productModel->findAll();
---
SELECT *
FROM `products`
WHERE `products`.`deleted_at` IS NULL

    public function products()
    {
        $request = \Config\Services::request();
        $productModel = new ProductModel($db);
        $categoryModel = new CategoryModel($db);
        $optionCat=0;
        if($request->getPostGet('id')){
            $optionCat=$request->getPostGet('id');
        }


        $category = $categoryModel->findAll();
        $products = $productModel->findAll();
---
SELECT *
FROM `products`
WHERE `products`.`deleted_at` IS NULL