app/Models/SalesModel.php

    public function getVentasAll() {
        $db = \Config\Database::connect(); //conecta a la base de datos
        $builder = $db->table('sales'); //tabla venta
        $builder->select('');
        //obtiene la relacion entre  las tablas (trae todos los campos)
        $builder->join('users', 'users.id = sales.id_user');

        $query = $builder->get(); //guarda
---
SELECT *
FROM `sales`
JOIN `users` ON `users`.`id` = `sales`.`id_user`